/*
*********************************************************************************************************
*	函 数 名: 均值滤波
*	功能说明: 用计数的方式把数据累加到n次然后除以n得到数据的平均值
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int data_f; //滤波后的数据
int data_tmp;
int cnt_num;

void Ave_filt(void)
{
	int data_get = get_data();//采集数据，get_data()自定义
	data_tmp += data_get;
	cnt_num++;
	if(cnt_num>=16)
	{
		cnt_num = 0;
		data_tmp>>=4;
		data = data_tmp;
	}
}

/*
*********************************************************************************************************
*	函 数 名: 限幅滤波
*	功能说明: 若相邻两次采样的数据大于偏差值则不采用新数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#define Adjust 5  //自定义偏差值
int Value;
int data_f; //滤波后的数据

void Wave_filt(int New_Value)
{
	int D_Value;
	if(Value >= New_Value)
	{
		D_Value = Value - New_Value; //当前值与上一个值相差
	}
	else
	{
		D_Value = New_Value - Value;
	}
	if(D_Value <= Adjust)
	{
		data_f = New_Value;	//偏差小，取当前值
	}
	else
	{
		data_f = Value;		//偏差大，取上一个值
	}
	Value = New_Value;		//把当前值赋给上一个值，等下次测试用
}

/*
*********************************************************************************************************
*	函 数 名: 中值滤波
*	功能说明: 取数据的中间值
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#define	N 11
int	Value[N];
int	median; // 中位数
int	Cnt_xx = 0;

void Get_Median(void)
{
	uint16_t Value_buf;

	/* 测量11位数据，并将数据记录下来 */
	Value[Cnt_xx] = data;
	Cnt_xx++;

	/* Value[]数组中的数据采用冒泡排序法从小到大排序 */
	if(Cnt_xx > N)
	{
		Cnt_xx = 0;
		uint8_t Icnt = 0;
		while(Icnt < N-1)
		{
			// 从最后一个数开始，相邻两个数依次比较，并适当地调整位置
			j = N-1;
			for(int j = 0; 	j < N-1; j++){
				if(j > Icnt)
				{
					if(Value[j] < Value[j-1]) // 判断相邻的两个数据大小，
					{
						// 若后一个值比前一个值大，位置不变
						// 若后一个值比前一个值小，则将两个数据位置替换
						Value_buf = Value[j];
						Value[j] = Value[j-1];
						Value[j-1] = Value_buf;
					}
					j => j-1;
				}
			}	
		}
		median = Value[N/2];
	}
}

